<template>
  <div class="doc-container">
    <v-btn
      :to="localePath('/terms-summarized')"
      class="mb-4"
    >
      要約版はこちら
    </v-btn>
    <section>
      <p>
        この規約は、お客様が「{{ $t("common.appName") }}」(以下「本アプリ」)のアカウントサービスをご利用いただく上での取り扱いにつき定めるものです。本規約に同意の上で本サービスをご利用ください。
      </p>
    </section>
    <section>
      <h2>第1条 (定義)</h2>
      <p>本規約において使用する以下の用語は、以下に定めるとおりとします。</p>
      <ol>
        <li>本アプリ：「{{ $t("common.appName") }}」と言う名称で私chikaが個人で運営・開発するサービス。</li>
        <li>利用者：本アプリをご利用いただくすべての方、あるいはアカウントサービスを利用する方</li>
        <li>個人情報：メールアドレス等個人を特定することのできる情報の総称。</li>
        <li>
          知的財産：発明、考案、植物の新品種、意匠、著作物その他の人間の創造的活動により生み出されるもの（発見または解明がされた自然の法則または現象であって、産業上の利用可能性があるものを含む）、商標、商号その他事業活動に用いられる商品または役務を表示するもの及び営業秘密その他の事業活動に有用な技術上または営業上の情報
        </li>
        <li>
          知的財産権：特許権、実用新案権、育成者権、意匠権、著作権、商標権その他の知的財産に関して法令により定められた権利または法律上保護される利益に係る権利
        </li>
      </ol>
    </section>

    <section>
      <h2>第2条 (本規約への同意)</h2>
      <p>利用者は、本利用規約に同意頂いた上で、本アプリを利用できるものとします。</p>
      <p>本アプリに最初にアクセスした際に表示されるバナーにて「同意する」ボタンを押すことで、本規約には同意したものとみなされます。</p>
    </section>

    <section>
      <h2>第3条 (規約の変更)</h2>
      <p>本アプリは、本規約を随時変更することがあります。変更後の本規約は、本アプリのサイト上に掲載された時点から効力を生じるものとします。</p>
      <p>利用者は、本アプリを利用している場合、本規約の変更後も本アプリを利用している場合には、変更後の本規約に同意したものとみなします。</p>
    </section>

    <section>
      <h2>第4条 (アカウントの管理)</h2>
      <p>利用者は、利用に際して登録した情報(以下「登録情報」)について、自己の責任の下、任意に登録・管理するものとします。</p>
      <p>
        私は、登録情報によって本サービスの利用があった場合、利用登録を行った本人が利用したものとし、当該利用によって生じた損害について、一切の責任は利用者に帰属するものとします。
      </p>
    </section>

    <section>
      <h2>第5条 (個人情報等の取扱)</h2>
      <p>個人情報および利用者情報については、別途定める「プライバシーポリシー」に従い、適切に取り扱うものとします。</p>
    </section>

    <section>
      <h2>第6条 (禁止行為)</h2>
      <p>利用者は、本サービスを利用するにあたり、以下の行為を行ってはならないものとします。</p>
      <p>(1) 私または第三者の知的財産権を侵害する行為</p>
      <p>(2) 本サービスを利用して他人に不利益、損害、不快感を与える行為</p>
      <p>(3) 私または第三者に対する脅迫的な行為</p>
      <p>(4) コンピューターウィルス、有害なプログラムを使用、またはそれを誘発する行為</p>
      <p>(5) 本サービス用インフラ設備に対して過度な負荷をかける行為</p>
      <p>(6) 当サイトのサーバーやシステム、セキュリティに対する攻撃を行う行為</p>
      <p>(7) 私が提供するインターフェース以外の方法で本サービスを利用、またはそれを試みる行為</p>
      <p>(8) その他、私が不適切と判断する行為</p>
    </section>

    <section>
      <h2>第7条 (免責事項)</h2>
      <p>
        私は、本サービスの内容変更、中断、終了、一時的な停止、登録情報の破棄等により、本サービスの利用ができなくなった場合、本サービスの利用によって生じた損害について、一切の責任を負いません。
      </p>
      <p>私は、利用者の本サービスの利用環境について一切関与せず、また一切の責任を負いません。</p>
      <p>
        私は、本サービスが利用者の特定の目的に適合すること、期待する機能・価値・正確性・有用性を有すること、および不具合が生じないことについて何ら保証するものではありません。
      </p>
      <p>
        私は、本サービスが全ての情報端末に対応していることを保証するものではなく、本サービスの利用に供する情報端末のOSバージョンアップ等により、本サービスの動作に不具合が生じる可能性があることにつき、利用者は予め了承するものとします。
      </p>
      <p>私は、本サービスを利用したことにより直接的または間接的に利用者に発生した損害について、一切賠償責任を負いません。</p>
    </section>

    <section>
      <h2>第8条 (準拠法)</h2>
      <p>本規約の解釈にあたっては、日本法を準拠法とします。</p>
    </section>

    <div class="data">
      最終更新 2023/05/05
    </div>
  </div>
</template>

<script lang="ts" setup>
definePageMeta({
  title: "terms",
})
</script>
