<template>
  <div class="doc-container">
    <p>こちらは利用規約の要約版です。重要な部分のみを切り出して記載しています。</p>

    <section>
      <h2>アカウントの管理について</h2>
      <p>アカウントの管理責任はすべて利用者にあります。アカウントを利用したことによって生じた損害には、私に重過失があった場合を除き、私は一切責任を負いません。</p>
    </section>

    <section>
      <h2>禁止行為</h2>
      <p>以下の行為は絶対に行わないでください。</p>
      <ul>
        <li>私と他の利用者を含め、他人に不利益を生じさせるような使い方をする行為。</li>
        <li>本サービスのサーバー設備に対して攻撃を行う行為。</li>
        <li>その他、私が不適切と判断する行為 (詳細はフルサイズの利用規約をご覧ください)。</li>
      </ul>
    </section>

    <section>
      <h2>免責事項</h2>
      <p>本サービスが予告なく提供を終了したとしても、私は一切責任を負いません。</p>
      <p>本サービスに不具合等が生じないこと、及び情報の正確性を保証するものではありません。</p>
      <p>本サービスの利用によって利用者に不利益が生じたとしても、私は一切責任を負いません。</p>
    </section>

    <div class="data">
      最終更新 2023/05/05
    </div>
  </div>
</template>

<script lang="ts" setup>
usePageTitle(tx("pageTitles.termsSummarized"))
</script>
